# Отчет по лабораторной работе № 14
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Татаркин Иван Владимирович

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Вложенные циклы с параметрами. Обход и линеаризация матриц
2. **Цель работы**: Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже
порядке следования (обхода).
3. **Задание**: 11 вариант.

4. **Идея, метод, алгоритм решения задачи**:
    - Считать поочерёдно вводимые пользователем размер и элементы матрицы в двумерный массив.
    - С помощью вложенных циклов вывести элементы в нужном порядке.
5. **Сценарий выполнения работы**:
   1. Ввести переменную размера матрицы ```size```, считать её введённое значение.
   2. С помощью двух вложенных циклов ```for``` считать вводимые с новой строки элементы матрицы (слева направо, затем
сверху вниз) в двумерный массив целых чисел.
   3. Ввести цикл ```for```, итерирующий переменную ```count``` от размера матрицы до 0 (номера параллельных побочной
диагоналей, по которым проходит порядок вывода элементов).
   4. В этот цикл вложить два других вложенных цикла, которые итерируются по номерам от размера матрицы до 0 до.
   5. В теле нижнего цикла, если сумма номеров равна ```count```, выводится соответствующее значение элементов матрицы.
   
6. **Листинг**:
```
#include <stdio.h>

int main(void) {
    int size;
    scanf("%d", &size);
    int matrix[size][size];
    int i, j;
    for (int i = 0; i < size; i++) {
        for (int j = 0; j < size ; j++) {
            scanf("%d\n", &matrix[i][j]);
        }

    } 
    for (int count = 0; count <= size - 1; count++) {
        if (count % 2 != 0) {
            for (int i = 0; i <= count; i++) {
                for (int j = 0; j <= count; j++) {
                    if (i + j == count) {
                        printf("%d ", matrix[size - i - 1][size - j - 1]);
                    }
                }
            }
        } else {
            for (int i = count; i >= 0; i--) {
                for (int j = count; j >= 0; j--) {
                    if (i + j == count) {
                        printf("%d ", matrix[size - i - 1][size - j - 1]);
                    }
                }
            }
        }
    }

    for (int count = size - 2; count >= 0; count--) {
        if (count % 2 == 0) {
            for (int i = 0; i <= count; i++) {
                for (int j = 0; j <= count; j++) {
                    if (i + j == count) {
                        printf("%d ", matrix[i][j]);
                    }
                }
            }
        } else {
            for (int i = count; i >= 0; i--) {
                for (int j = count; j >= 0; j--) {
                    if (i + j == count) {
                        printf("%d ", matrix[i][j]);
                    }
                }
            }
        }
    }

    return 0;
}
```

7. **Замечания автора**:-

8. **Выводы**: Составлена и отлажена программа ввода квадратной матрицы и печати в строку всех её 
элементов в заданном порядке следования (обхода). Получен опыт обработки числовых матриц и использованием многомерных
массивов и вложенных циклов.
