# Отчет по лабораторной работе № 13
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Татаркин Иван Владимирович

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Множества
2. **Цель работы**: В соответствии с вариантом задания составить программу проверки характеристик введённых 
последовательностей слов и печати развёрнутого ответа. 
3. **Задание (вариант №11)**: Есть ли гласная, входящая в состав всех слов?

4. **Идея, метод, алгоритм решения задачи**:
    - Будем работать в английском алфавите.
    - В алгоритме будут считываться по порядку слова, будет вычисляться пересечение множества букв слова с множеством гласных букв.
5. **Сценарий выполнения работы**:
   1. Ввести множества ```vowels``` и гласных букв.
   2. Ввести функции ```separator``` , проверяющую символ на соответствие одному из разделителей.
   3. Ввести пустое множество ```word```. С помощью цикла ```while``` и функции ```getchar``` считывать поочереди 
символы очередного слова и добавлять их в множество, приводя к нижнему регистру функцией ```towlower```.
   4. Искать пересечение ```word``` с множеством  ```vowels```, тем самым проверяя наличие в слове гласных букв.
   5. В завершение вывести сообщения об отсутствии или о наличии гласных букв, которые встречаются во всех словах.

6. **Листинг**:
```
#include <stdio.h>
#include <stddef.h>
#include <wctype.h>

int separator(char s) {
    char *m = " \t,\n";
    for (int i = 0; i < 4; i++) {
        if (s == m[i]) return 1;
    }
    return 0;
}

int main(void) {
    const unsigned int lu = 1;
    char *s = "aeiouy";
    unsigned int vowels = 0;

    for (int i = 0; i < 6; i++) {
        vowels = vowels | lu << (s[i] - 'a');
    }
    unsigned int word = 0;
 
    char chr;
    int f = 0;
    while ((chr = getchar()) != EOF) {
        //int check = separator(chr);
        //printf("%ds\n", check);
        if (separator(chr) && word) {
            vowels = vowels & word;
            //printf("%dss\n", vowels);
            word = 0;
        } else if (separator(chr) == 0){
            f++;
            word = word | (lu << (towlower(chr) - 'a'));
            //printf("%d\n", word);
        }
    }
    if (f == 0){
        printf("\nthere are no vowels included in all words");
    }

    else{
        if (word != 0){
            vowels = vowels & word;
        }
        if (vowels) {
            for (char i = 'a'; i <= 'z'; i++){
                if ((vowels & (lu << (towlower(i) - 'a'))) != 0){
                    printf("%c\n", i);
                }
            }
        }                                                   
        else {
            printf("\nthere are no vowels included in all words");
        }

        return 0;
    }
}

```

7. **Замечания автора** по существу работы: отсутствуют.

8. **Выводы**: Составлена и отлажена программа на языке Си, выполняющая проверку характеристик введённых 
последовательностей слов.
Получен опыт работы с множествами в Си.
