# Отчет по лабораторной работе № 12
## по курсу "Фундаментальная информатика"

Студент группы М80-108Б-23 Татаркин Иван Владимирович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с целыми числами.
2. **Цель работы**: Составить программу на языке Си в целом типе данных, которая выполняет указанное действие над их значениями.
3. **Задание**:
- Вычислить обратый десятичый код.
4. **Идея, метод, алгоритм решения задачи**: 
-Будем использовать состояния для обработки очередного знака входного файла.
5. **Сценарий выполнения работы**: 
- Выделим 2 состояния для обработки отрицательного и положительного. 
- Если число отрицательное, то умножаем ответ на 10 и добавляем к нему (9 - текущая цифра).
- Если число положительное, то умножаем ответ на 10 и добавляем к нему текущую цифру.
6. **Протокол**:
```
#include <stdio.h>
#include <string.h>
int main(void){
    int state = 1;
    int symbol;
    int ans = 0;
    while ((symbol = getchar()) != EOF){
        switch (state) {
            case 1:
                if (symbol == '-'){
                    state = 2;
                }
                else if (symbol == '+'){
                    state = 1;
                }
                else if (symbol == '0'){
                    ans = ans * 10;
                }
                else if (symbol == '1'){
                    ans = ans * 10 + 1;
                }
                else if (symbol == '2'){
                    ans = ans * 10 + 2;
                }
                else if (symbol == '3'){
                    ans = ans * 10 + 3;
                }
                else if (symbol == '4'){
                    ans = ans * 10 + 4;
                }
                else if (symbol == '5'){
                    ans = ans * 10 + 5;
                }
                else if (symbol == '6'){
                    ans = ans * 10 + 6;
                }
                else if (symbol == '7'){
                    ans = ans * 10 + 7;
                }
                else if (symbol == '8'){
                    ans = ans * 10 + 8;
                }
                else if (symbol == '9'){
                    ans = ans * 10 + 9;
                }
                break;
            case 2:
                if (symbol == '0'){
                    ans = ans * 10 + 9;
                }
                else if (symbol == '1'){
                    ans = ans * 10 + 8;
                }
                else if (symbol == '2'){
                    ans = ans * 10 + 7;
                }
                else if (symbol == '3'){
                    ans = ans * 10 + 6;
                }
                else if (symbol == '4'){
                    ans = ans * 10 + 5;
                }
                else if (symbol == '5'){
                    ans = ans * 10 + 4;
                }
                else if (symbol == '6'){
                    ans = ans * 10 + 3;
                }
                else if (symbol == '7'){
                    ans = ans * 10 + 2;
                }
                else if (symbol == '8'){
                    ans = ans * 10 + 1;
                }
                else if (symbol == '9'){
                    ans = ans * 10;
                }
                break;
        default:
            break;
        }
    }
    printf("%d\n", ans);
}
```
7. **Замечания автора** : -
8. **Выводы**: В работе с целыми числами мне понравилась возможность использовать различные операции и алгоритмы для решения задач. Полученные знания пригодятся мне при работе с математическими моделями, программировании и анализе данных. В итоге узнал новые техники обработки и использования целых чисел, что позволит мне эффективнее решать задачи в будущем.
