# Отчет по лабораторной работе № 12
## по курсу "Фундаментальная информатика"

Студент группы М80-108Б-23 Татаркин Иван Владимирович

Работа выполнена 

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Техника работы с целыми числами.
2. **Цель работы**: Составить программу на языке Си в целом типе данных, которая выполняет указанное действие над их значениями.
3. **Задание**:
- Вычислить обратый десятичый код.
4. **Идея, метод, алгоритм решения задачи**: 
-Будем использовать состояния для обработки очередного знака входного файла.
5. **Сценарий выполнения работы**: 
- Выделим 2 состояния для обработки отрицательного и положительного. 
- Если число отрицательное, то умножаем ответ на 10 и добавляем к нему (9 - текущая цифра).
- Если число положительное, то умножаем ответ на 10 и добавляем к нему текущую цифру.
6. **Протокол**:
```
#include <stdio.h>
#include <stdlib.h>
int main(void){
    int state = 1;
    int symbol;
    int ans;
    scanf("%d", &ans);
    if (ans > 0){
        printf("%d\n", ans);
    }
    else{

        int ans1 = abs(ans);
        int q = 0;

        if (ans1 == 0){
            q = 1;
        }
        while (ans1 != 0){
            q += 1;
            ans1 = ans1 / 10;
        }
        int dop = 0;
        for (int i = 0; i < q; i++){
            dop = dop * 10 + 9;
        }
        ans = dop - abs(ans);
        printf("%d\n", ans);
    }
}
```
7. **Замечания автора** : -
8. **Выводы**: В работе с целыми числами мне понравилась возможность использовать различные операции и алгоритмы для решения задач. Полученные знания пригодятся мне при работе с математическими моделями, программировании и анализе данных. В итоге узнал новые техники обработки и использования целых чисел, что позволит мне эффективнее решать задачи в будущем.
