# Отчет по лабораторной работе № 15
## по курсу "Фундаментальная информатика"

Студент группы М8О-108Б-23 Татаркин Иван Владимирович

Работа выполнена

Преподаватель: каф. 806 Севастьянов Виктор Сергеевич

1. **Тема**: Обработка матриц
2. **Цель работы**: Составить программу на языке Си, производящую обработку квадратной матрицы из целых чисел.
3. **Задание (вариант №4)**: Перестановка строк с минимальным и максимальным произведением элементов. (с максимальными номаерами соответственно).
4. **Идея, метод, алгоритм решения задачи**:
    - Считать поочерёдно вводимые пользователем размер и элементы матрицы в двумерный массив.
    - С помощью вложенных циклов подсчитать поменять местами нужные строки.
побочной диагонали.
5. **Сценарий выполнения работы**:
   1. Ввести переменную размера матрицы ```size```, считать её введённое значение.
   2. С помощью двух вложенных циклов ```for``` считать вводимые с новой строки элементы матрицы (слева направо, затем
сверху вниз) в двумерный массив целых чисел.
   3. С помощью цикла ```for```, найти строки с максималыным и минимальным произведением и поменять их местами
   4. Вывести изменённую матрицу в отформатированном виде.
   
6. **Листинг**:
```
#include <stdio.h>

int main(void) {
    int size;
    FILE * file = stdin;
    fscanf(file, "%d", &size);
    int matrix[size][size];
    int i, j;
    for (int i = 0; i < size && !feof(file); i++) {
        for (int j = 0; j < size && !feof(file); j++) {
            fscanf(file, "%d", &matrix[i][j]);
        }
        putchar('\n');
    }
    fclose(file);

    int max_product = 1;
    int min_product = 2147483646;
    int ma_i = 0;
    int mi_i = 0;
    for (int i = 0; i < size; i++) {
        int cur_prouct = 1;
        for (int j = 0; j < size; j++) {
            cur_prouct *= matrix[i][j];
        }
        if (cur_prouct >= max_product){
            max_product = cur_prouct;
            ma_i = i;
        }
        if (cur_prouct <= min_product){
            min_product = cur_prouct;
            mi_i = i;
        }
    }
    for (int i = 0; i < size; i++) {
        for(int j = 0; j < size; j++) {
            if (i == ma_i){
                printf("%d ", matrix[mi_i][j]);
            }
            else if (i == mi_i){
                printf("%d ", matrix[ma_i][j]);
            }
            else{
                printf("%d ", matrix[i][j]);
            }
        }
        putchar('\n');
    }
    return 0;
}
```

7. **Замечания автора**:-

8. **Выводы**: Составлена и отлажена программа, производящая обработку квадратной матрицы из целых чисел и 
видоизменяющая её в соответствии с заданием. Расширен опыт работы с матрицами и многомерными массивами, выполнения 
сложных преобразований матриц.
